Revit 2027 API
FabricationServiceButton.GetImage Method
Gets the image for fabrication service button.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Bitmap GetImage()
Public Overridable Function GetImage As Bitmap
public:
virtual Bitmap^ GetImage()
abstract GetImage : unit -> Bitmap
override GetImage : unit -> Bitmap
Return Value
Bitmap
System.Drawing.Bitmap represents the fabrication service button image. null if there is no preview image.
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace